//---------------------------------------------------------------------------
//!	@file	InputKey.h
//! @brief	キー入力管理
//---------------------------------------------------------------------------
#pragma once
#include "DxLib.h"

//===========================================================================
//!	@name	システム関数
//===========================================================================
//@{

//! 初期化
void InputKeyInit();

//! 更新
int  InputKeyUpdate();

//! 終了
void InputKeyExit();

//@}
//===========================================================================
//!	@name	入力関連関数
//===========================================================================
//@{

//! 指定キーの1回だけ押下検証
//! @param	[in]	keyID	キー種別
//! @retval true	引数に指定されたキーが押された
//! @retval false	引数に指定されたキーが押されていない
bool IsKeyOn(int keyID);

//! 指定キーが押されていない検証
//! @param	[in]	keyID	キー種別
//! @retval true	引数に指定されたキーが離されている
//! @retval false	引数に指定されたキーが押されている
bool IsKeyRelease(int keyID);

//! 指定キーの長押し検証
//! @param	[in]	keyID	キー種別
//! @retval true	引数に指定されたキーが長押し（2フレーム以上）されている
//! @retval false	引数に指定されたキーが押されていない（押されているフレーム数が1以下）
bool IsKeyRepeat(int keyID);

//@}
